const haito = {
    "l10": "一右雨円王音下火花貝学気九休玉金空月犬見五口校左三山子四糸字耳七車手十出女小上森人水正生青夕石赤千川先早草足村大男竹中虫町天田土二日入年白八百文木本名目立力林六",
    "l9":  "引羽雲園遠何科夏家歌画回会海絵外角楽活間丸岩顔汽記帰弓牛魚京強教近兄形計元言原戸古午後語工公広交光考行高黄合谷国黒今才細作算止市矢姉思紙寺自時室社弱首秋週春書少場色食心新親図数西声星晴切雪船線前組走多太体台地池知茶昼長鳥朝直通弟店点電刀冬当東答頭同道読内南肉馬売買麦半番父風分聞米歩母方北毎妹万明鳴毛門夜野友用曜来里理話",
    "l8":  "悪安暗医委意育員院飲運泳駅央横屋温化荷界開階寒感漢館岸起期客究急級宮球去橋業曲局銀区苦具君係軽血決研県庫湖向幸港号根祭皿仕死使始指歯詩次事持式実写者主守取酒受州拾終習集住重宿所暑助昭消商章勝乗植申身神真深進世整昔全相送想息速族他打対待代第題炭短談着注柱丁帳調追定庭笛鉄転都度投豆島湯登等動童農波配倍箱畑発反坂板皮悲美鼻筆氷表秒病品負部服福物平返勉放味命面問役薬由油有遊予羊洋葉陽様落流旅両緑礼列練路和",
    "l7":  "愛案以衣位囲胃印英栄塩億加果貨課芽改械害街各覚完官管関観願希季紀喜旗器機議求泣救給挙漁共協鏡競極訓軍郡径型景芸欠結建健験固功好候航康告差菜最材昨札刷殺察参産散残士氏史司試児治辞失借種周祝順初松笑唱焼象照賞臣信成省清静席積折節説浅戦選然争倉巣束側続卒孫帯隊達単置仲貯兆腸低底停的典伝徒努灯堂働特得毒熱念敗梅博飯飛費必票標不夫付府副粉兵別辺変便包法望牧末満未脈民無約勇要養浴利陸良料量輪類令冷例歴連老労録",
    "l6":  "圧移因永営衛易益液演応往桜恩可仮価河過賀快解格確額刊幹慣眼基寄規技義逆久旧居許境均禁句群経潔件券険検限現減故個護効厚耕鉱構興講混査再災妻採際在財罪雑酸賛支志枝師資飼示似識質舎謝授修述術準序招承証条状常情織職制性政勢精製税責績接設舌絶銭祖素総造像増則測属率損退貸態団断築張提程適敵統銅導徳独任燃能破犯判版比肥非備俵評貧布婦富武復複仏編弁保墓報豊防貿暴務夢迷綿輸余預容略留領",
    "l5":  "異遺域宇映延沿我灰拡革閣割株干巻看簡危机揮貴疑吸供胸郷勤筋系敬警劇激穴絹権憲源厳己呼誤后孝皇紅降鋼刻穀骨困砂座済裁策冊蚕至私姿視詞誌磁射捨尺若樹収宗就衆従縦縮熟純処署諸除将傷障城蒸針仁垂推寸盛聖誠宣専泉洗染善奏窓創装層操蔵臓存尊宅担探誕段暖値宙忠著庁頂潮賃痛展討党糖届難乳認納脳派拝背肺俳班晩否批秘腹奮並陛閉片補暮宝訪亡忘棒枚幕密盟模訳郵優幼欲翌乱卵覧裏律臨朗論",
    "l4":  "握扱依威為偉違維緯壱芋陰隠影鋭越援煙鉛縁汚押奥憶菓暇箇雅介戒皆壊較獲刈甘汗乾勧歓監環鑑含奇祈鬼幾輝儀戯詰却脚及丘朽巨拠距御凶叫狂況狭恐響驚仰駆屈掘繰恵傾継迎撃肩兼剣軒圏堅遣玄枯誇鼓互抗攻更恒荒香項稿豪込婚鎖彩歳載剤咲惨旨伺刺脂紫雌執芝斜煮釈寂朱狩趣需舟秀襲柔獣瞬巡旬盾召床沼称紹詳丈畳殖触飾侵振浸寝慎震薪尽陣尋吹是井姓征跡占扇鮮訴僧燥騒贈即俗耐替沢拓濁脱丹淡嘆端弾恥致遅蓄沖跳徴澄沈珍抵堤摘滴添殿吐途渡奴怒到逃倒唐桃透盗塔稲踏闘胴峠突鈍曇弐悩濃杯輩拍泊迫薄爆髪抜罰般販搬範繁盤彼疲被避尾微匹描浜敏怖浮普腐敷膚賦舞幅払噴柄壁捕舗抱峰砲忙坊肪冒傍帽凡盆慢漫妙眠矛霧娘茂猛網黙紋躍雄与誉溶腰踊謡翼雷頼絡欄離粒慮療隣涙隷齢麗暦劣烈恋露郎惑腕",
    "l3":  "哀慰詠悦閲炎宴欧殴乙卸穏佳架華嫁餓怪悔塊慨該概郭隔穫岳掛滑肝冠勘貫喚換敢緩企岐忌軌既棋棄騎欺犠菊吉喫虐虚峡脅凝斤緊愚偶遇刑契啓掲携憩鶏鯨倹賢幻孤弧雇顧娯悟孔巧甲坑拘郊控慌硬絞綱酵克獄恨紺魂墾催債削搾錯撮擦暫祉施諮侍慈軸疾湿赦邪殊寿潤遵如徐匠昇掌晶焦衝鐘冗嬢錠譲嘱辱伸辛審炊粋衰酔遂穂随髄瀬牲婿請斥隻惜籍摂潜繕阻措粗礎双桑掃葬遭憎促賊怠胎袋逮滞滝択卓託諾奪胆鍛壇稚畜窒抽鋳駐彫脹超聴陳鎮墜帝訂締哲斗塗凍陶痘匿篤豚尿粘婆排陪縛伐帆伴畔藩蛮卑碑泌姫漂苗赴符封伏覆紛墳癖募慕簿芳邦奉胞倣崩飽縫乏妨房某膨謀墨没翻魔埋膜又魅滅免幽誘憂揚揺擁抑裸濫吏隆了猟陵糧厘励零霊裂廉錬炉浪廊楼漏湾",
    "l2p": "亜尉逸姻韻疫謁猿凹翁虞渦禍靴寡稼蚊拐懐劾涯垣核殻嚇潟括喝渇褐轄且缶陥患堪棺款閑寛憾還艦頑飢宜偽擬糾窮拒享挟恭矯暁菌琴謹襟吟隅勲薫茎渓蛍慶傑嫌献謙繭顕懸弦呉碁江肯侯洪貢溝衡購拷剛酷昆懇佐唆詐砕宰栽斎崎索酢桟傘肢嗣賜滋璽漆遮蛇勺酌爵珠儒囚臭愁酬醜汁充渋銃叔淑粛塾俊准殉循庶緒叙升抄肖尚宵症祥渉訟硝粧詔奨彰償礁浄剰縄壌醸津唇娠紳診刃迅甚帥睡錘枢崇据杉畝斉逝誓析拙窃仙栓旋践銑遷薦繊禅漸租疎塑壮荘挿捜曹喪槽霜藻妥堕惰駄泰濯但棚痴逐秩嫡衷弔挑眺釣懲勅朕塚漬坪呈廷邸亭貞逓偵艇泥迭徹撤悼搭棟筒謄騰洞督凸屯軟尼妊忍寧把覇廃培媒賠伯舶漠肌鉢閥煩頒妃披扉罷猫賓頻瓶扶附譜侮沸雰憤丙併塀幣弊偏遍浦泡俸褒剖紡朴僕撲堀奔麻摩磨抹岬銘妄盲耗匁厄愉諭癒唯悠猶裕融庸窯羅酪痢履柳竜硫虜涼僚寮倫累塁戻鈴賄枠",
    "l2":  "挨曖宛嵐畏萎椅彙茨咽淫唄鬱怨媛艶旺岡臆俺苛牙瓦楷潰諧崖蓋骸柿顎葛釜鎌韓玩伎亀毀畿臼嗅巾僅錦惧串窟熊詣憬稽隙桁拳鍵舷股虎錮勾梗喉乞傲駒頃痕沙挫采塞埼柵刹拶斬恣摯餌鹿𠮟嫉腫呪袖羞蹴憧拭尻芯腎須裾凄醒脊戚煎羨腺詮箋膳狙遡曽爽痩踪捉遜汰唾堆戴誰旦綻緻酎貼嘲捗椎爪鶴諦溺塡妬賭藤瞳栃頓貪丼那奈梨謎鍋匂虹捻罵剝箸氾汎阪斑眉膝肘訃阜蔽餅璧蔑哺蜂貌頰睦勃昧枕蜜冥麺冶弥闇喩湧妖瘍沃拉辣藍璃慄侶瞭瑠呂賂弄籠麓脇",
    "l1p": "丑丞乃之乍乎也云亙亘些亥亦亨亮仇什仔伊伍伽佃佑伶侃佼俄俠俣倭俱倦倖偓偲傭僑僻儘儲允兇兎兜其冴凋凌凧凪凰凱函剃劃劉劫勿匙匡匪廿卜卦叩卯卿厭叉叛叡叢叶只吃吊吋吾吞吠吻呆咳哉哨哩啞啄啐喬喧喋喰嘉嘗嘩噓噌噂噺噸嚙囊圃圭坐坤坦尭垢埴埠堰堵堺塙塘塵壕壬壺夙夷奄套妓姑妾姐娃姦姪姥姶娩娼婁嬉嬰嬬孟宏宋宕宥寅寓寵尖尤屍屑屢岨岱峨峻嶋峯嵩嵯嶺巌巳巴巷巽匝帖幌幡庄庇庚庖庵廓厩廠厨廟廻弘弗弛弼彊彦彪彬徽忽怯怜恢恰恕悉悌惟惚惣惇悶惹愈慧慾憐戊戎或戟托扮按挺捌挽掩掬捲捷捺捧掠揃揖搔摑摺摸撰撒撞撚播撫擢擾攪孜敦斐斌斡斧斯於旭昂昏昌晃晋晒晦智暢曙曝曳沓朋朔杏杖杜杓李杢杭杵枇杷柑柴柘柊柁柏柚栂柾桓桔桂栴桐栗梧梱梓梢梯桶梶梁棲栖棉椋椀椙椛楳楢楯楚椿楠楓楊椴榎榛槍槌槙榊槻樟樗樋樫樺橘樵橡樽楕檜橿檎檀檮櫛櫓欣欽歎此歪殆毅毘汀汝汐汲沌沫洩洲洛浩浬淵淳渚淀淘淋渥渠湘湊湛涌溢溜漑漕漣漉澗潑澱濠濡濤瀆瀦瀕瀞灌灘灸灼烏烹焰焚煤煉煽燕燐燦燭爺爾牌牒牝牟牡牢牽犀狐狗狛狸狼狽猪猷獅玖珂珊玲珪琉琢瑛琶琵琳瑚瑞瑳瓜瓢甑甜甥甫畠畦畢畷疋疏疹痔癌皐盃盈碗瞥矧矩砦砥砧硯硲碍碓碇碧碩磐磯礪礦祁祇祐禄禎禦禱禰禽禾禿秤秦稀稔稗稜穎穆穣龝穿窄窪窺竈竣靖罫竺竿笈笥笠笹筈筑筏箕箔箭篇篦篠簞簸簾粁粂籾粍粕粥粟糊糎糠糟糞紘紗紐絃紬絢綬綜綴緋綾緬縞繫繡纂纏翠翫翰耀而耽聡聯聾肇宍肋肴肱胤胡脆腔膏腿膿臥舘舛舜舵艮苅芥芹芭芙苑茄苫苒苔苧茅苓荊茸荏茜莞荻莫菅菰菖菟菩萌萊菱萄葦葵萱萩葺葱董葡葎蓑蒜蒔蒐蒼蒲蒙蓉蔭蔚蔣蔦蔓蓬蔀蓮蕎蕨蕉蕊蕃蕩蕪薙蕗薗薩薯藷藪藁蘇蘭虻蚤蛋蛙蛤蛭蛛蛾蛸蜘蝦蝕蝶螺蟬蟹蟻蠅蠣蠟衿袈袷袴裡裟裳襖覗訊訣詑註詫誼諏誹諒謂諫諺諜謬讃竪豹貰賑賤贋赫趨跨蹟蹄軀輔輯輿轍轟轡辰辻迂迄辿迦迺這逗逢遁逼遥遼邇邑郁耶鄭酉酋醇醍醐醬醱釘釦釧鈷鉤鉦鉾銚鋪鋤鋒鋲鋸錐錆錫鍔鍬鍾鍍錨鎧鎗鎚熔鏑鐙鐸鑓閃閏閤阿陀隈隼雀雁雛雫霞靱鞍鞘鞄鞠鞭韃韮頁頗頸顚飴餐饗馨馴馳駈駁駕駿驒髭魁魯鮎鮒鮪鮭鮫鯉鯖鯛鰍鰭鰯鰹鰺鰻鱈鱒鱗鰐鳩鳶鳳鴇鴛鴨鴦鴫鴻鵠鵜鵡鵬鶯鸚鷗鷲鷹鷺鹼麒麟麴麿黍黛鼎鼠勺錘銑脹匁",
};

$(function() {
    $("#description").show();
    $("#desc_level span, #loading, .tips").hide();

    const show_all = () => {
        let $chars = $("#list li.joyo, li.hyogai, li.kglyph").css("display", "block").show();
        $("#desc_0").show();
        $(".tips").show();
        $("#description .count").show().text($chars.size());
    };

    // タブでフィルタ表示
    $("#tab li").click(function() {
        $("#desc_level span").hide();

        if ($(this).hasClass("selected")) {
            $(this).removeClass("selected");
            show_all();
            return;
        }

        $("#tab li").removeClass("selected");
        $(this).addClass("selected");

        let level = $("#tab li.selected").attr("id").split("_").pop();
        $("#desc_" + level).show();
        $("#list li").hide();
        $(".tips")[(level == "1p" || level == "1") ? "show" : "hide"]();
        
        let $chars = $("#list li.l" + level).show();
        $("#description .count").show().text($chars.size());
    });

    // ダブルクリックで漢字ペディアへジャンプ
    $("#list li a").dblclick(function() {
        let path = $(this).attr("name");
        if (!path) return;
        let url = "http://www.kanjipedia.jp/kanji/" + path;
        window.open(url);
    });
/*
    // 掲出字の画像表示
    $("#list li.kglyph").click(function() {
        if ($(this).hasClass("img")) return;
        let $img = $(this).find("img:last");
        let path = "pediapng/" + $img.attr("src").split("/").pop();
        $("<img>").attr("src", path).prependTo(this);
        $(this).addClass("img");
    });
*/
    // 級分け
    const extjis = $(".extjislist .ref").map(function(){ return $(this).text(); })
        .get().join("");

    $("li.joyo, li.hyogai, li.kglyph").each(function() {
        let $li = $(this);
        let c = $li.text();
        let ret = Object.keys(haito).some(level => {
            if (haito[level].indexOf(c) < 0) return false;
            if (level > "l2" && !$li.hasClass("joyo")) return false;
            $li.addClass(level);
            return true;
        });

        if (!ret) {
            $li.addClass("l1");
        }
        if (extjis.indexOf(c) != -1) $li.addClass("extjis");
    });

    // TIPS書式化
    $(".tips .ref").each(function() {
        let $td = $(this);
        let list = $td.text().trim();
        $td.text("");
        Array.from(list).forEach((c) => {
            $("<li>").text(c).appendTo($td);
        });
    });

    show_all();
});
